Introduction to Pandas

Series & Dataframe

Creation of dataframes, Exploring Data (Series and Dataframe)

Operations on Dataframe

In [75]:
import pandas as pd
import numpy as np

Series

A one-dimensional array like structure along with indices as label.

In [76]:
s1=pd.Series([34,67,90,34,12,67])
s1

0    34
1    67
2    90
3    34
4    12
5    67
dtype: int64

In [77]:
print(s1[0])

34

In [78]:
print(s1[0:3])

0    34
1    67
2    90
dtype: int64

In [79]:
print(s1[0::2])

0    34
2    90
4    12
dtype: int64

Dataframe

A multi-dimensional (2D) array like structure along with indices as label!

In [80]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [81]:
df=pd.DataFrame({
    'name' : ["vansh","abhay","dhruvi"],
    'age' : [20,18,22],
    'marks' : [80,98,94],
})
df

     name  age  marks
0   vansh   20     80
1   abhay   18     98
2  dhruvi   22     94

In [82]:
df["name"]

0     vansh
1     abhay
2    dhruvi
Name: name, dtype: object

In [83]:
df[["name","marks"]]

     name  marks
0   vansh     80
1   abhay     98
2  dhruvi     94

In [84]:
df["name"][0]

'vansh'

In [85]:
df[["name","marks"]]

     name  marks
0   vansh     80
1   abhay     98
2  dhruvi     94

In [86]:
df["marks"]

0    80
1    98
2    94
Name: marks, dtype: int64

In [87]:
df

     name  age  marks
0   vansh   20     80
1   abhay   18     98
2  dhruvi   22     94

In [88]:
df["city"]=["delhi","mumbai","pune"]
df

     name  age  marks    city
0   vansh   20     80   delhi
1   abhay   18     98  mumbai
2  dhruvi   22     94    pune

In [89]:
df["city"]=["surat","baroda","ahmedabad"]
df

     name  age  marks       city
0   vansh   20     80      surat
1   abhay   18     98     baroda
2  dhruvi   22     94  ahmedabad

In [90]:
print(df)

     name  age  marks       city
0   vansh   20     80      surat
1   abhay   18     98     baroda
2  dhruvi   22     94  ahmedabad

In [91]:
df["age"].dtype

dtype('int64')

In [92]:
df.dtypes

name     object
age       int64
marks     int64
city     object
dtype: object

In [93]:
type(df)

pandas.core.frame.DataFrame

In [94]:
type(s1)

pandas.core.series.Series

In [95]:
df["marks"]

0    80
1    98
2    94
Name: marks, dtype: int64

In [96]:
df["marks"]+2

0     82
1    100
2     96
Name: marks, dtype: int64

In [97]:
df["marks"]-2

0    78
1    96
2    92
Name: marks, dtype: int64

In [98]:
df["marks"]*2

0    160
1    196
2    188
Name: marks, dtype: int64

In [99]:
df["marks"]/2

0    40.0
1    49.0
2    47.0
Name: marks, dtype: float64

In [100]:
df["marks"]%2

0    0
1    0
2    0
Name: marks, dtype: int64

In [101]:
df

     name  age  marks       city
0   vansh   20     80      surat
1   abhay   18     98     baroda
2  dhruvi   22     94  ahmedabad

In [102]:
df["marks"]=df["marks"]+2
df

     name  age  marks       city
0   vansh   20     82      surat
1   abhay   18    100     baroda
2  dhruvi   22     96  ahmedabad

In [103]:
df

     name  age  marks       city
0   vansh   20     82      surat
1   abhay   18    100     baroda
2  dhruvi   22     96  ahmedabad

In [104]:
type(df["marks"])

pandas.core.series.Series

In [105]:
df2=pd.DataFrame([
    ["aryan","vansh","dhruvi"],
    [20,22,8],
    [98,78,86],
])
df2

       0      1       2
0  aryan  vansh  dhruvi
1     20     22       8
2     98     78      86

In [111]:
df2=pd.DataFrame([
    ["aryan","vansh","dhruvi"],
    [20,22,8],
    [98,78,86],
],index=["name","age","marks"])
df2

           0      1       2
name   aryan  vansh  dhruvi
age       20     22       8
marks     98     78      86

In [112]:
df2=pd.DataFrame([
    ["aryan","vansh","dhruvi"],
    [20,22,8],
    [98,78,86],
],columns=["name","age","marks"])
df2

    name    age   marks
0  aryan  vansh  dhruvi
1     20     22       8
2     98     78      86

In [113]:
type(df2)

pandas.core.frame.DataFrame

In [114]:
type(df2['name'])

pandas.core.series.Series

In [115]:
# iloc&loc

In [117]:
dd=[
    ["Alice",25,"new york"],
    ["Bob",30,"london"],
    ["Charlie",22,"Paris"],
]
dd

[['Alice', 25, 'new york'], ['Bob', 30, 'london'], ['Charlie', 22, 'Paris']]

In [118]:
df2=pd.DataFrame(dd,columns=["Name","Age","City"])
df2

      Name  Age      City
0    Alice   25  new york
1      Bob   30    london
2  Charlie   22     Paris

In [119]:
df2["Name"]

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [120]:
df2.Name

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [121]:
df2.Name[0]

'Alice'

In [122]:
df2

      Name  Age      City
0    Alice   25  new york
1      Bob   30    london
2  Charlie   22     Paris

In [123]:
df2.iloc[0]

Name       Alice
Age           25
City    new york
Name: 0, dtype: object

In [124]:
df2.iloc[0:2]

    Name  Age      City
0  Alice   25  new york
1    Bob   30    london

In [125]:
df2.iloc[0::2]

      Name  Age      City
0    Alice   25  new york
2  Charlie   22     Paris

In [126]:
df2.iloc[0:2,0:2]

    Name  Age
0  Alice   25
1    Bob   30

In [127]:
df2.iloc[0]

Name       Alice
Age           25
City    new york
Name: 0, dtype: object

how to set index from existing column

In [131]:
df3=df2.set_index("Name")

In [132]:
df3

         Age      City
Name
Alice     25  new york
Bob       30    london
Charlie   22     Paris

In [133]:
df3.loc["Bob"]

Age         30
City    london
Name: Bob, dtype: object

In [134]:
df3.loc[["Alice","Charlie"]]

         Age      City
Name
Alice     25  new york
Charlie   22     Paris

In [135]:
df3.loc["Alice":"Bob"]

       Age      City
Name
Alice   25  new york
Bob     30    london

In [137]:
df3.loc[df3["City"]!="london"]

         Age      City
Name
Alice     25  new york
Charlie   22     Paris